results/spring-quarkus-perf-comparison/2026-03-03_03-19-23/wrk-warmup-spring4-jvm-2.log
Running 2m test @ http://localhost:8080/fruits
  2 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    27.07ms   39.15ms 599.79ms   90.44%
    Req/Sec   3693.88   1261.80  6129.00     60.00
  443266 requests in 120.03s, 357.58MB read
Requests/sec: 3692.96
Transfer/sec:   2.98MB